leetcode_2262_total_appeal_of_a_string.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2262. Total Appeal of A String</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2262. Total Appeal of A String</h1>
<ul class="org-ul">
<li><a href="is_there_an_alternative_problem_easier_to_solve.html#ID-64E7E55B-09A9-4022-AB5E-1D25FC64EAC9">Is there an alternative problem easier to solve?</a>  Count the number of substring that \(s[i]\) is the first appearance of \(s[i]\) on it.  For strings starting on \(i\), it will appear on \(N - i\) of those.  It will appear in the mid of \((i - prev[s[i]]) \times (N - i - 1)\) where \(prev[s[i]]\) is the last occurrence of \(s[i]\) on \(0..(i-1)\).  Time complexity is \(O(n)\) and space is \(O(1)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">appealSum</span>(<span style="font-weight: bold;">self</span>, s: <span style="font-weight: bold;">str</span>) -&gt; <span style="font-weight: bold;">int</span>:
        N = <span style="font-weight: bold;">len</span>(s)
        <span style="font-weight: bold; font-style: italic;">last</span> = defaultdict(<span style="font-weight: bold;">lambda</span>: -1)
        <span style="font-weight: bold; font-style: italic;">prev</span> = [-1] * N
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold; font-style: italic;">prev</span>[<span style="font-weight: bold; font-style: italic;">i</span>] = last[s[i]]
            last[<span style="font-weight: bold; font-style: italic;">s</span>[i]] = i
        <span style="font-weight: bold; font-style: italic;">ans</span> = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(N):
            <span style="font-weight: bold; font-style: italic;">ans</span> += (N - i) * (i - prev[i])
        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</body>
</html>